Author: Mohd Azam
Date: July, 2019

We can think of a DataFrame as a bunch of Series objects put together to share the same index or think dataframe is like a Excel sheet where we can find the Coloums,Row numbers and data

In [2]:
import pandas as pd
import numpy as np

In [47]:
# First Parameter is matrix of 5x4 with random number
df = pd.DataFrame(np.random.randn(5,4),index= ['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [48]:
df

          W         X         Y         Z
A -0.562218  1.353064  1.764563 -0.372966
B -0.148951 -1.431976 -0.649257 -1.118271
C  0.384209  0.177459 -1.258340  0.871344
D  1.298122 -0.365291  0.478208  1.816828
E  0.568706 -0.734297  0.557239 -0.889938

In [49]:
df['X']

A    1.353064
B   -1.431976
C    0.177459
D   -0.365291
E   -0.734297
Name: X, dtype: float64

In [50]:
df[['X','Y']]

          X         Y
A  1.353064  1.764563
B -1.431976 -0.649257
C  0.177459 -1.258340
D -0.365291  0.478208
E -0.734297  0.557239

In [51]:
# We can access in this way BUT not recommended
df.X

A    1.353064
B   -1.431976
C    0.177459
D   -0.365291
E   -0.734297
Name: X, dtype: float64

In [52]:
# Suppose we need to add new Coloum with sum of X and Y Coloum
df['Sum Of X+Y'] = df['X']+df['Y']

In [53]:
df

          W         X         Y         Z  Sum Of X+Y
A -0.562218  1.353064  1.764563 -0.372966    3.117627
B -0.148951 -1.431976 -0.649257 -1.118271   -2.081234
C  0.384209  0.177459 -1.258340  0.871344   -1.080881
D  1.298122 -0.365291  0.478208  1.816828    0.112917
E  0.568706 -0.734297  0.557239 -0.889938   -0.177058

In [54]:
# Now remove the 'Sum Of X+Y' coloum

axis = 0 mean row and axis = 1 mean Coloum

In [55]:
df.drop('Sum Of X+Y',axis=1)

          W         X         Y         Z
A -0.562218  1.353064  1.764563 -0.372966
B -0.148951 -1.431976 -0.649257 -1.118271
C  0.384209  0.177459 -1.258340  0.871344
D  1.298122 -0.365291  0.478208  1.816828
E  0.568706 -0.734297  0.557239 -0.889938

In [56]:
df

          W         X         Y         Z  Sum Of X+Y
A -0.562218  1.353064  1.764563 -0.372966    3.117627
B -0.148951 -1.431976 -0.649257 -1.118271   -2.081234
C  0.384209  0.177459 -1.258340  0.871344   -1.080881
D  1.298122 -0.365291  0.478208  1.816828    0.112917
E  0.568706 -0.734297  0.557239 -0.889938   -0.177058

In [57]:
# Again 'Sum Of X+Y' this coloum appear, just because we didn't do inplace ='ture'

In [58]:
df.drop('Sum Of X+Y',axis=1,inplace=True)

In [115]:
df

             A         B
G1 1 -0.610943  1.598398
   2  0.821964  1.151446
   3 -1.850929 -0.379590
G2 1 -0.585748  0.157691
   2 -0.046987 -1.132022
   3  1.074820  1.978175

In [60]:
# Row Selection

In [61]:
df.loc['A']

W   -0.562218
X    1.353064
Y    1.764563
Z   -0.372966
Name: A, dtype: float64

In [62]:
# Index is 2 mean Row C
df.iloc[2]

W    0.384209
X    0.177459
Y   -1.258340
Z    0.871344
Name: C, dtype: float64

In [63]:
df.loc[['A','D']]

          W         X         Y         Z
A -0.562218  1.353064  1.764563 -0.372966
D  1.298122 -0.365291  0.478208  1.816828

In [64]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  1.353064  1.764563
B -1.431976 -0.649257

In [72]:
# Select the rows in range, first parameter is start and second is last 
df.iloc[2:5]

          W         X         Y         Z
C  0.384209  0.177459 -1.258340  0.871344
D  1.298122 -0.365291  0.478208  1.816828
E  0.568706 -0.734297  0.557239 -0.889938

#### Conditional Selection

In [73]:
df

          W         X         Y         Z
A -0.562218  1.353064  1.764563 -0.372966
B -0.148951 -1.431976 -0.649257 -1.118271
C  0.384209  0.177459 -1.258340  0.871344
D  1.298122 -0.365291  0.478208  1.816828
E  0.568706 -0.734297  0.557239 -0.889938

In [75]:
# Will return condition return value 
df>0

       W      X      Y      Z
A  False   True   True  False
B  False  False  False  False
C   True   True  False   True
D   True  False   True   True
E   True  False   True  False

In [77]:
# Only Ture value will filtered 
df[df>0]

          W         X         Y         Z
A       NaN  1.353064  1.764563       NaN
B       NaN       NaN       NaN       NaN
C  0.384209  0.177459       NaN  0.871344
D  1.298122       NaN  0.478208  1.816828
E  0.568706       NaN  0.557239       NaN

In [83]:
df[df['W']>0]

          W         X         Y         Z
C  0.384209  0.177459 -1.258340  0.871344
D  1.298122 -0.365291  0.478208  1.816828
E  0.568706 -0.734297  0.557239 -0.889938

In [88]:
df[df['W']>0][['X','Y']]

          X         Y
C  0.177459 -1.258340
D -0.365291  0.478208
E -0.734297  0.557239

In [93]:
# Set Index and Reset Index

In [94]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.562218  1.353064  1.764563 -0.372966
1     B -0.148951 -1.431976 -0.649257 -1.118271
2     C  0.384209  0.177459 -1.258340  0.871344
3     D  1.298122 -0.365291  0.478208  1.816828
4     E  0.568706 -0.734297  0.557239 -0.889938

In [95]:
df['Country'] = ['US','UK','Italy','Dubai','India']

In [96]:
df

          W         X         Y         Z Country
A -0.562218  1.353064  1.764563 -0.372966      US
B -0.148951 -1.431976 -0.649257 -1.118271      UK
C  0.384209  0.177459 -1.258340  0.871344   Italy
D  1.298122 -0.365291  0.478208  1.816828   Dubai
E  0.568706 -0.734297  0.557239 -0.889938   India

In [97]:
df.set_index('Country')

                W         X         Y         Z
Country
US      -0.562218  1.353064  1.764563 -0.372966
UK      -0.148951 -1.431976 -0.649257 -1.118271
Italy    0.384209  0.177459 -1.258340  0.871344
Dubai    1.298122 -0.365291  0.478208  1.816828
India    0.568706 -0.734297  0.557239 -0.889938

In [99]:
# Why index didn't set ?
df

          W         X         Y         Z Country
A -0.562218  1.353064  1.764563 -0.372966      US
B -0.148951 -1.431976 -0.649257 -1.118271      UK
C  0.384209  0.177459 -1.258340  0.871344   Italy
D  1.298122 -0.365291  0.478208  1.816828   Dubai
E  0.568706 -0.734297  0.557239 -0.889938   India

In [100]:
df.set_index('Country', inplace=True)

In [101]:
df

                W         X         Y         Z
Country
US      -0.562218  1.353064  1.764563 -0.372966
UK      -0.148951 -1.431976 -0.649257 -1.118271
Italy    0.384209  0.177459 -1.258340  0.871344
Dubai    1.298122 -0.365291  0.478208  1.816828
India    0.568706 -0.734297  0.557239 -0.889938

#### Multi-Index and Index Hierarchy

In [102]:
# Creating multi level index base datafarme, No need to understand the code at this stage

# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [103]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [104]:
df

             A         B
G1 1 -0.610943  1.598398
   2  0.821964  1.151446
   3 -1.850929 -0.379590
G2 1 -0.585748  0.157691
   2 -0.046987 -1.132022
   3  1.074820  1.978175

In [106]:
df.loc['G1']

          A         B
1 -0.610943  1.598398
2  0.821964  1.151446
3 -1.850929 -0.379590

In [111]:
df.loc['G1'].loc[1]

A   -0.610943
B    1.598398
Name: 1, dtype: float64

In [113]:
df.loc['G1'].loc[[1,2]]

          A         B
1 -0.610943  1.598398
2  0.821964  1.151446